package zadanie2;

public class Задание {
    /*
    1. Циклы:
    + 1.1. Перемножить числа от 1 до числа (включительно) введенного через аргумент к исполняемой программе.
        Пример: Ввели 5, должно получиться в консоли: 1 * 2 * 3 * 4 * 5 = ответ
    + 1.2. Все цифры из числа введенного через аргумент к исполняемой программе перемножить между собой и вывести ход вычислений в консоль.
        Пример: Ввели 181232375, должно получиться в консоли: 1 * 8 * 1 * 2 * …. * 5 = ответ
    + 1.3. Возведение в степень. Через консоль пользователь вводит два числа. Первое число это число которое мы будем возводить,
        Второе число это степень в которую возводят первое число. Степень - только положительная и целая.
        Возводимое число - может быть отрицательным и дробным. Math использовать нельзя.
    + 1.4.* Умножать число long a = 1; на 3 пока не произойдёт переполнение.
        В конце в консоль вывести сообщение со значением до переполнения и после переполнения
    + 1.5. Вывести таблицу умножения в консоль. В консоли должно получиться также как и на картинке (динозаврика рисовать не надо):
        https://www.dropbox.com/s/ibakfuppvy2w32g/multiplication_table.jpeg?dl=0
2. Массивы:
	+2.1 Вывести все элементы в консоль. Элементы массива вводить через консоль.
	    Массив хранит в себе числа. Выводить при помощи:
	+	2.1.1. do....while
	+	2.1.2. while
	+	2.1.3. for
	+	2.1.4. foreach.
	+ 2.2 Вывести каждый второй элемент массива в консоль
	+ 2.3 Вывести все элементы массива в консоль в обратном порядке.
	    Элементы массива вводить через консоль. Массив хранит в себе числа. Выводить при помощи:
	+	2.3.1. do....while
	+	2.3.2. while
	+	2.3.3. for
	+	2.3.4. foreach
+ 3. Нарисовать блок схему алгоритма работы пузырьковой сортировки.
+ 4. Выполнить сортировку массива с числами:
+	4.0. !!!!ВНИМАНИЕ!!!! код сортировок в данном ДЗ не должен дублироваться.
	    Дублирование кода сортировок приведёт к провалу выполнения данного задания.
	    Итогом выполнения данного задания будет 1 класс сортировок, и классы с main методами.
+	4.1. После каждой сортировки в консоли у вас должно получиться "[Какой массив был до сортировки] -> [Каким стал массив после сортировки]".
	    Для вывода можно использовать Arrays.
+	4.2. Пишем следующие алгоритмы:
+		4.2.1. Пузырьковая сортировка
+		4.2.2. Шейкерная сортировка
+	4.3. Для тестов используем предварительно созданные массивы (в коде ваши тесты должны остаться):
+		4.3.1. {1,2,3,4,5,6}
+		4.3.2. {1,1,1,1}
+		4.3.3. {9,1,5,99,9,9}
+		4.3.4. {}
+	4.4. После тестов написать код который будет создавать массив рандомной длинны, заполнять массив рандомными числами
+	4.5. После рандома написать код который будет создавать массив руками через консоль
     */
}
